diplom-src/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ВКМ_НачислениеЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработнойПлаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикиРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.ВКМ_КатегорииСпециалистов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикиРаботы.Resource.ВКМ_Часы</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикиРаботы.Dimension.ВКМ_Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Параметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВКМ_КатегорииСпециалистов</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

diplom-src/src/InformationRegisters/ВКМ_СведенияДляРасчетаЗарплаты/ВКМ_СведенияДляРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_СведенияДляРасчетаЗарплаты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВКМ_КатегорииСпециалистов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

diplom-src/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.Сотрудник,
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.Начисление,
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.ДатаНачала,
		|	КонецПериода(ВКМ_НачислениеЗаработнойПлатыНачисления.ДатаОкончания, ДЕНЬ) КАК ДатаОкончания,
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.ГрафикРаботы,
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.Категория,
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.Ссылка.МесяцНачисления КАК ПериодРегистрации
		|ПОМЕСТИТЬ втНачисления
		|ИЗ
		|	Документ.ВКМ_НачислениеЗаработнойПлаты.Начисления КАК ВКМ_НачислениеЗаработнойПлатыНачисления
		|ГДЕ
		|	ВКМ_НачислениеЗаработнойПлатыНачисления.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втНачисления.Сотрудник,
		|	втНачисления.Начисление КАК ВидРасчета,
		|	втНачисления.ДатаНачала КАК ПериодДействияНачало,
		|	втНачисления.ДатаОкончания КАК ПериодДействияКонец,
		|	втНачисления.ДатаНачала КАК БазовыйПериодНачало,
		|	втНачисления.ДатаОкончания КАК БазовыйПериодКонец,
		|	втНачисления.ГрафикРаботы КАК График,
		|	втНачисления.Категория,
		|	втНачисления.ПериодРегистрации,
		|	естьnull(ВКМ_СведенияДляРасчетаЗарплатыСрезПоследних.Оклад, 0) как Параметр
		|ИЗ
		|	втНачисления КАК втНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_СведенияДляРасчетаЗарплаты.СрезПоследних(&НаДату, (Категория, Сотрудник) В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				втНачисления.Категория,
		|				втНачисления.Сотрудник
		|			ИЗ
		|				втНачисления КАК втНачисления)) КАК ВКМ_СведенияДляРасчетаЗарплатыСрезПоследних
		|		ПО втНачисления.Сотрудник = ВКМ_СведенияДляРасчетаЗарплатыСрезПоследних.Сотрудник
		|		И втНачисления.Категория = ВКМ_СведенияДляРасчетаЗарплатыСрезПоследних.Категория";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НаДату", МесяцНачисления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Параметр = 0 Тогда
			Отказ = Истина;
			// текст пользователю
		КонецЕсли;
			
		НовСтрока = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, ВыборкаДетальныеЗаписи);		
		НовСтрока.Сторно = Ложь;		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Движения.Записать();

	//ВКМ_РасчетЗарплаты.РассчитатьОсновныеНачисления(Ссылка, Движения.ВКМ_ОсновныеНачисления);
	//// регистр ВКМ_Удержания
	//Движения.ВКМ_Удержания.Записывать = Истина;
	//Движение = Движения.ВКМ_Удержания.Добавить();
	//Движение.Сторно = Ложь;

КонецПроцедуры
